DataProcessors/Renault_НастройкаTDFa.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_НастройкаTDFa</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресПроксисервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПроксиCерверTDFa</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинПроксиСервераTDFa</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПроксисервераTDFa</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКTDFa</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/Renault_НастройкаTDFa/Ext/ObjectModule.bsl
Процедура ЗаписатьКонстанты() Экспорт
	
	Константы.Renault_Tdfa_КаталогПрограммы.Установить(ПутьКTDFa);
	
	Константы.Renault_ИспользоватьПроксиCерверTDFa.Установить(ИспользоватьПроксиCерверTDFa);
	Константы.Renault_ПроксиСерверTDFa.Установить(АдресПроксисервера);
	Константы.Renault_ЛогинПроксиСервераTDFa.Установить(ЛогинПроксиСервераTDFa);
	Константы.Renault_ПарольПроксисервераTDFa.Установить(ПарольПроксисервераTDFa);
	Константы.Renault_ПортПроксиСервераTDFa.Установить(ПортПрокси);
	
КонецПроцедуры

//Получаем значения констант
ПутьКTDFa					 = Константы.Renault_Tdfa_КаталогПрограммы.Получить();

//Прокси -сервер
ИспользоватьПроксиCерверTDFa = Константы.Renault_ИспользоватьПроксиCерверTDFa.Получить();
АдресПроксисервера			 = Константы.Renault_ПроксиСерверTDFa.Получить();
ПортПрокси					 = Константы.Renault_ПортПроксиСервераTDFa.Получить();
ЛогинПроксиСервераTDFa		 = Константы.Renault_ЛогинПроксиСервераTDFa.Получить();
ПарольПроксисервераTDFa		 = Константы.Renault_ПарольПроксисервераTDFa.Получить();
